app/views/bullet_points/_bullet_point.html.erb

SELECT "bullet_points".* FROM "bullet_points" WHERE ("bullet_points".lesson_id = 1)
---
   	</span>
	<% unless bullet_point.bullet_point_content.blank? %>

SELECT "bible_verses".* FROM "bible_verses" WHERE ("bible_verses".bullet_point_id = 121)
SELECT COUNT(*) FROM "bible_verses" WHERE ("bible_verses".bullet_point_id = 121)
---
	<div class="bullet-point-time"></div>
	<% unless bullet_point.bible_verses.empty? %>