app/views/users/show.html.erb


<% unless @user.microposts.empty? %>
---
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 6)