app/views/shared/_user_info.html.erb

<span><%= current_user.name %></span>
<span><%= pluralize(current_user.microposts.count, "micropost") %></span>
---
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 101)