app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = 1 LIMIT 1
SELECT "bullet_points".* FROM "bullet_points" WHERE ("bullet_points".lesson_id = 1) LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "bullet_points" WHERE ("bullet_points".lesson_id = 1)
---
  def show
    @lesson = Lesson.find(params[:id])
    @bullet_points = @lesson.bullet_points.paginate(:page => params[:page])