app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ('hi my name is perry!', 101, '2011-11-06 06:18:43.667282', '2011-11-06 06:18:43.667282')