app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin", "first_name", "last_name", "phone", "esl", "country", "start_date", "end_date", "english_help", "living_help", "fun_help", "notes") VALUES ('Perry Zheng', 'perry.zheng@gmail.com', '2011-09-21 10:09:34.573170', '2011-09-21 10:09:34.573170', '3d6ed44b809aecd65c02e92f21bf38cebc99aee5c97bfd3488b6dcced736f6f3', '6aa5c7de65af0ef345fb4c9af286cd276cff195f0f712b8588ff10c8feef2ac4', 'f', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "first_name" = 'Perry', "last_name" = 'Zheng', "phone" = '917-518-5151', "country" = 'China', "start_date" = '10/2013', "end_date" = '10/2015', "esl" = 'no', "english_help" = 'no', "living_help" = 'no', "fun_help" = 'yes', "notes" = 'awesome', "encrypted_password" = '8c3067d66cfd77850b9ed437770f8b3647d59696d0f5427816b2d99c266a190c', "updated_at" = '2011-09-21 10:36:02.601785' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 6) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])